Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFF144.atdf
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1"/>
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x1"/>
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x1"/>
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1"/>
         <value caption="No effect" name="" value="0x0"/>
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff"/>
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1"/>
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1"/>
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1"/>
         <value caption="FSCM has not detected clock failure" name="" value="0x0"/>
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1"/>
         <value caption="A general NMI event has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1"/>
         <value caption="An NMI will not be generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1"/>
         <value caption="WDT time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1"/>
         <value caption="DMT time-out has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1"/>
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CVR"/>
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS"/>
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR"/>
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE"/>
            <bitfield mask="0x00000300" name="BGSEL"/>
            <bitfield mask="0x00000400" name="VREFSEL"/>
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00008000" name="ON" values="CVRCON__ON"/>
         </register>
      </register-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source, CVRSRC = (VREF+) - (VREF-)" name="" value="0x1"/>
         <value caption="Comparator voltage reference source, CVRSRC = AVDD - AVSS" name="" value="0x0"/>
      </value-group>
      <value-group caption="CVref Range Selection bit" name="CVRCON__CVRR">
         <value caption="0 to 0.67 CVrsrc" name="" value="0x1"/>
         <value caption="0.25 CVrsrc to 0.75 CVrsrc" name="" value="0x0"/>
      </value-group>
      <value-group caption="CVrefout Enable bit" name="CVRCON__CVROE">
         <value caption="Voltage level is output on CVrefout pin" name="" value="0x1"/>
         <value caption="Voltage level is disconnected from CVrefout pin" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Voltage Reference On bit" name="CVRCON__ON">
         <value caption="Module is enabled. Setting this bit does not affect other bits in the register." name="" value="0x1"/>
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in the register." name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="01500" name="DMAC" version="2">
      <register-group name="DMAC">
         <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY"/>
            <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND"/>
            <bitfield caption="DMA On bit" mask="0x00010000" name="ON" values="DMACON__ON"/>
         </register>
