Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFF144.atdf
         <register caption="" name="LATF" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF0"/>
            <bitfield mask="0x00000002" name="LATF1"/>
            <bitfield mask="0x00000004" name="LATF2"/>
            <bitfield mask="0x00000008" name="LATF3"/>
            <bitfield mask="0x00000010" name="LATF4"/>
            <bitfield mask="0x00000020" name="LATF5"/>
            <bitfield mask="0x00000040" name="LATF6"/>
            <bitfield mask="0x00000080" name="LATF7"/>
            <bitfield mask="0x00000100" name="LATF8"/>
            <bitfield mask="0x00000200" name="LATF9"/>
            <bitfield mask="0x00000400" name="LATF10"/>
            <bitfield mask="0x00000800" name="LATF11"/>
            <bitfield mask="0x00001000" name="LATF12"/>
            <bitfield mask="0x00002000" name="LATF13"/>
            <bitfield mask="0x00004000" name="LATF14"/>
            <bitfield mask="0x00008000" name="LATF15"/>
         </register>
         <register caption="" name="LATG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG0"/>
            <bitfield mask="0x00000002" name="LATG1"/>
            <bitfield mask="0x00000004" name="LATG2"/>
            <bitfield mask="0x00000008" name="LATG3"/>
            <bitfield mask="0x00000010" name="LATG4"/>
            <bitfield mask="0x00000020" name="LATG5"/>
            <bitfield mask="0x00000040" name="LATG6"/>
            <bitfield mask="0x00000080" name="LATG7"/>
            <bitfield mask="0x00000100" name="LATG8"/>
            <bitfield mask="0x00000200" name="LATG9"/>
            <bitfield mask="0x00000400" name="LATG10"/>
            <bitfield mask="0x00000800" name="LATG11"/>
            <bitfield mask="0x00001000" name="LATG12"/>
            <bitfield mask="0x00002000" name="LATG13"/>
            <bitfield mask="0x00004000" name="LATG14"/>
            <bitfield mask="0x00008000" name="LATG15"/>
         </register>
         <register caption="" name="LATH" offset="0x730" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATH0"/>
            <bitfield mask="0x00000002" name="LATH1"/>
            <bitfield mask="0x00000004" name="LATH2"/>
            <bitfield mask="0x00000008" name="LATH3"/>
            <bitfield mask="0x00000010" name="LATH4"/>
            <bitfield mask="0x00000020" name="LATH5"/>
            <bitfield mask="0x00000040" name="LATH6"/>
            <bitfield mask="0x00000080" name="LATH7"/>
            <bitfield mask="0x00000100" name="LATH8"/>
            <bitfield mask="0x00000200" name="LATH9"/>
            <bitfield mask="0x00000400" name="LATH10"/>
            <bitfield mask="0x00000800" name="LATH11"/>
            <bitfield mask="0x00001000" name="LATH12"/>
            <bitfield mask="0x00002000" name="LATH13"/>
            <bitfield mask="0x00004000" name="LATH14"/>
            <bitfield mask="0x00008000" name="LATH15"/>
         </register>
         <register caption="" name="LATJ" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATJ0"/>
            <bitfield mask="0x00000002" name="LATJ1"/>
            <bitfield mask="0x00000004" name="LATJ2"/>
            <bitfield mask="0x00000008" name="LATJ3"/>
            <bitfield mask="0x00000010" name="LATJ4"/>
            <bitfield mask="0x00000020" name="LATJ5"/>
            <bitfield mask="0x00000040" name="LATJ6"/>
            <bitfield mask="0x00000080" name="LATJ7"/>
            <bitfield mask="0x00000100" name="LATJ8"/>
            <bitfield mask="0x00000200" name="LATJ9"/>
            <bitfield mask="0x00000400" name="LATJ10"/>
            <bitfield mask="0x00000800" name="LATJ11"/>
            <bitfield mask="0x00001000" name="LATJ12"/>
            <bitfield mask="0x00002000" name="LATJ13"/>
            <bitfield mask="0x00004000" name="LATJ14"/>
            <bitfield mask="0x00008000" name="LATJ15"/>
         </register>
         <register caption="" name="LATK" offset="0x930" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATK0"/>
            <bitfield mask="0x00000002" name="LATK1"/>
            <bitfield mask="0x00000004" name="LATK2"/>
            <bitfield mask="0x00000008" name="LATK3"/>
            <bitfield mask="0x00000010" name="LATK4"/>
            <bitfield mask="0x00000020" name="LATK5"/>
            <bitfield mask="0x00000040" name="LATK6"/>
            <bitfield mask="0x00000080" name="LATK7"/>
            <bitfield mask="0x00000100" name="LATK8"/>
            <bitfield mask="0x00000200" name="LATK9"/>
            <bitfield mask="0x00000400" name="LATK10"/>
            <bitfield mask="0x00000800" name="LATK11"/>
            <bitfield mask="0x00001000" name="LATK12"/>
            <bitfield mask="0x00002000" name="LATK13"/>
            <bitfield mask="0x00004000" name="LATK14"/>
            <bitfield mask="0x00008000" name="LATK15"/>
         </register>
         <register caption="" name="ODCA" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCA0"/>
            <bitfield mask="0x00000002" name="ODCA1"/>
            <bitfield mask="0x00000004" name="ODCA2"/>
            <bitfield mask="0x00000008" name="ODCA3"/>
            <bitfield mask="0x00000010" name="ODCA4"/>
            <bitfield mask="0x00000020" name="ODCA5"/>
            <bitfield mask="0x00000040" name="ODCA6"/>
            <bitfield mask="0x00000080" name="ODCA7"/>
            <bitfield mask="0x00000100" name="ODCA8"/>
            <bitfield mask="0x00000200" name="ODCA9"/>
            <bitfield mask="0x00000400" name="ODCA10"/>
            <bitfield mask="0x00000800" name="ODCA11"/>
            <bitfield mask="0x00001000" name="ODCA12"/>
            <bitfield mask="0x00002000" name="ODCA13"/>
            <bitfield mask="0x00004000" name="ODCA14"/>
            <bitfield mask="0x00008000" name="ODCA15"/>
         </register>
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB0"/>
            <bitfield mask="0x00000002" name="ODCB1"/>
            <bitfield mask="0x00000004" name="ODCB2"/>
            <bitfield mask="0x00000008" name="ODCB3"/>
            <bitfield mask="0x00000010" name="ODCB4"/>
            <bitfield mask="0x00000020" name="ODCB5"/>
            <bitfield mask="0x00000040" name="ODCB6"/>
            <bitfield mask="0x00000080" name="ODCB7"/>
            <bitfield mask="0x00000100" name="ODCB8"/>
            <bitfield mask="0x00000200" name="ODCB9"/>
            <bitfield mask="0x00000400" name="ODCB10"/>
            <bitfield mask="0x00000800" name="ODCB11"/>
            <bitfield mask="0x00001000" name="ODCB12"/>
            <bitfield mask="0x00002000" name="ODCB13"/>
            <bitfield mask="0x00004000" name="ODCB14"/>
            <bitfield mask="0x00008000" name="ODCB15"/>
         </register>
