Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ0512EFF144.atdf
      <value-group caption="Write Strobe Polarity bit" name="PMCON__WRSP">
         <value caption="(Slave and Master mode 2) Write strobe active-high / (Master mode 1) Enable strobe active-high" name="" value="0x1"/>
         <value caption="(Slave and Master mode 2) Write strobe active-low / (Master mode 1) Enable strobe active-low" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chip Select 1 Polarity bit" name="PMCON__CS1P">
         <value caption="Active-high (PMCS1)" name="" value="0x1"/>
         <value caption="Active-low (PMCS1)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chip Select 2 Polarity bit" name="PMCON__CS2P">
         <value caption="Active-high (PMCS2)" name="" value="0x1"/>
         <value caption="Active-low (PMCS2)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Address Latch Polarity bit" name="PMCON__ALP">
         <value caption="Active-high (PMALL and PMALH)" name="" value="0x1"/>
         <value caption="Active-low (PMALL and PMALH)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chip Select Function bits" name="PMCON__CSF">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="PMCS1 and PMCS2 function as Chip Select" name="" value="0x2"/>
         <value caption="PMCS2 functions as Chip Select and PMCS1 functions as address bit 14" name="" value="0x1"/>
         <value caption="PMCS1 and PMCS2 function as address bit 14 and address bit 15" name="" value="0x0"/>
      </value-group>
      <value-group caption="Read/Write Strobe Port Enable bit" name="PMCON__PTRDEN">
         <value caption="PMRD/PMWR port is enabled" name="" value="0x1"/>
         <value caption="PMRD/PMWR port is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Write Enable Strobe Port Enable bit" name="PMCON__PTWREN">
         <value caption="PMWR/PMENB port is enabled" name="" value="0x1"/>
         <value caption="PMWR/PMENB port is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PMP Module TTL Input Buffer Select bit" name="PMCON__PMPTTL">
         <value caption="PMP module uses TTL input buffers" name="" value="0x1"/>
         <value caption="PMP module uses Schmitt Trigger input buffer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Address/Data Multiplexing Selection bits" name="PMCON__ADRMUX">
         <value caption="Lower 8 bits of address are multiplexed on PMD pins; upper 8 bits are not used" name="" value="0x3"/>
         <value caption="All 16 bits of address are multiplexed on PMD pins" name="" value="0x2"/>
         <value caption="Lower 8 bits of address are multiplexed on PMD pins" name="" value="0x1"/>
         <value caption="Address and data appear on separate pins" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="PMCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parallel Master Port Enable bit" name="PMCON__ON">
         <value caption="PMP is enabled" name="" value="0x1"/>
         <value caption="PMP is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Dual Read/Write Buffers enable bit" name="PMCON__DUALBUF">
         <value caption="PMP uses separate registers for reads and writes (PMRADDR" name="" value="0x1"/>
         <value caption="PMP uses legacy registers (PMADDR" name="" value="0x0"/>
      </value-group>
      <value-group caption="Start Read on PMP Bus bit" name="PMCON__RDSTART">
         <value caption="Start a read cycle on the PMP bus" name="" value="0x20"/>
         <value caption="No effect" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Hold After Read/Write Strobe Wait States bits" name="PMMODE__WAITE">
         <value caption="(for writes) Wait of 4 Tpbclk2 / (for reads) Wait of 3 Tpbclk2" name="" value="0x3"/>
         <value caption="(for writes) Wait of 3 Tpbclk2 / (for reads) Wait of 2 Tpbclk2" name="" value="0x2"/>
         <value caption="(for writes) Wait of 2 Tpbclk2 / (for reads) Wait of 1 Tpbclk2" name="" value="0x1"/>
         <value caption="(for writes) Wait of 1 Tpbclk2 (default) / (for reads) Wait of 0 Tpbclk2 (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Read/Write Strobe Wait States bits" name="PMMODE__WAITM">
         <value caption="Wait of 16 Tpbclk2" name="" value="0xf"/>
         <value caption="Wait of 2 Tpbclk2" name="" value="0x1"/>
         <value caption="Wait of 1 Tpbclk2 (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__MODE">
         <value caption="Master mode 1" name="" value="0x3"/>
         <value caption="Master mode 2" name="" value="0x2"/>
         <value caption="Enhanced Slave mode, control signals" name="" value="0x1"/>
         <value caption="Legacy Parallel Slave Port, control signals" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__WAITB">
         <value caption="Data wait of 4 Tpbclk2" name="" value="0x3"/>
         <value caption="Data wait of 3 Tpbclk2" name="" value="0x2"/>
         <value caption="Data wait of 2 Tpbclk2" name="" value="0x1"/>
         <value caption="Data wait of 1 Tpbclk2" name="" value="0x0"/>
      </value-group>
      <value-group caption="8/16-bit Mode bit" name="PMMODE__MODE16">
         <value caption="16-bit mode: a read or write to the data register invokes a single 16-bit transfer" name="" value="0x1"/>
         <value caption="8-bit mode: a read or write to the data register invokes a single 8-bit transfer" name="" value="0x0"/>
      </value-group>
